{
  "products": [
    {
      "name": "Death Note",
      "description": "Ягами Лайт — образцовый 17-летний выпускник, баллы за экзамены которого находятся в первых строках рейтинга всей Японии. Сидя на уроке, он замечает, что за окном что-то упало. На перемене он поднимает загадочный предмет и им оказывается черная тетрадь с надписью «Тетрадь смерти». Внутри была инструкция по использованию: «Человек, имя которого будет записано в тетради, умрет». Имея свои взгляды на систему наказания, Лайт решает установить собственное правосудие, использовать тетрадь для «очищения» мира от зла — убивать преступников.Когда действия Лайта становятся заметны для мирового правительства, на след неуловимого «Киры» (так мир окрестил нового мессию, решившего искоренить зло на планете) выходит детектив мирового класса, называющий себя «L», который поставил себе цель — разоблачить убийцу.",
      "type": "manga",
      "vipPrice": "30",
      "image": "https://staticlib.me/uploads/cover/desu-noto/cover/5UcB013CNhll_250x350.jpg",
      "year": "2003",
      "genres": [
        "Detective",
        "Fantasy",
        "action"
      ],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0
        }
      ],
      "id": 2,
      "comments": [
        {
          "userName": "TheCupOfTea",
          "comment": "Something",
          "userImg": "https://lh3.googleusercontent.com/a-/AOh14Ggf7puoi1Xa4rOOCSQikX17aUMVFWG4Ls14-M4b=s96-c",
          "userUid": "T48Ncy4IMkRRXYDBf1PP6VBdnyH2"
        }
      ],
      "price": 0
    },
    {
      "name": "Tokyo Revengers",
      "description": "Жестокая история о 26-летнем парне, что потерял свою единственную девушку в разборке уличных банд и скатился к серой убогой жизни нищего неудачника на подработке без каких-либо планов и перспектив. Но как-то вечером, возвращаясь домой, бедолага угодил под электричку и откатился во времени на 12 лет. А вернувшись в прошлое, он бросает все силы, чтобы войти в среду уличных банд и не дать единственной любви погибнуть.",
      "type": "manga",
      "vipPrice": "20",
      "image": "https://staticlib.me/uploads/cover/toukyou-revengers/cover/JZVxPMcpFMls_250x350.jpg",
      "year": "2017",
      "genres": [
        "Shonen",
        "action",
        "School"
      ],
      "rate": [
        {
          "rateAvg": 1.6,
          "rateAmount": 13,
          "rateSum": 20
        }
      ],
      "comments": [],
      "id": 3
    },
    {
      "name": "Demon Slayer",
      "description": "Танджиро - старший сын в семье, потерявшей кормильца. Однажды, он уходит в другой город, чтобы продать древесный уголь, но в конце концов остаётся на ночь в чужом доме, вместо того, чтобы идти домой. А всё из-за слухов о демоне, который разгуливает в горах под покровом ночи. Утром парень вернётся домой живой и невредимый... Но его ждут ужасные известия...",
      "type": "manga",
      "vipPrice": "10",
      "image": "https://staticlib.me/uploads/cover/kimetsu-no-yaiba/cover/4KagQthKA49B_250x350.jpg",
      "year": "2016",
      "genres": [
        "Fantasy",
        "Drama",
        "adventure"
      ],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0
        }
      ],
      "comments": [
        {
          "userName": "TheCupOfTea",
          "comment": "SDKJflsjdflj",
          "userImg": "https://lh3.googleusercontent.com/a-/AOh14Ggf7puoi1Xa4rOOCSQikX17aUMVFWG4Ls14-M4b=s96-c",
          "userUid": "T48Ncy4IMkRRXYDBf1PP6VBdnyH2"
        }
      ],
      "id": 4
    },
    {
      "name": "Promised Neverland",
      "description": "мма и её друзья вели вполне счастливую сиротскую жизнь в приюте. Да, там жёсткие правила, но зато смотритель добрый. Вот только почему детям запрещено приближаться к воротам и забору?.. Иногда не известно, стоит ли узнавать правду, которая полностью переворачивает всю твою жизнь.",
      "type": "manga",
      "vipPrice": "15",
      "image": "https://staticlib.me/uploads/cover/yakusoku-no-neverland/cover/V6PnrWysPZQ9_250x350.jpg",
      "year": "2016",
      "genres": [
        "action",
        "Detective",
        "Survival"
      ],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0,
          "uids": []
        }
      ],
      "comments": [
        {
          "userName": "TheCupOfTea",
          "comment": "Something",
          "userImg": "https://lh3.googleusercontent.com/a-/AOh14Ggf7puoi1Xa4rOOCSQikX17aUMVFWG4Ls14-M4b=s96-c",
          "userUid": "T48Ncy4IMkRRXYDBf1PP6VBdnyH2"
        }
      ],
      "id": 6
    },
    {
      "name": "My Hero Academia",
      "description": "В один прекрасный день на свет начали появляться люди со сверхспособностями, иначе говоря — причудами. Так возникло общество сверхлюдей, где почти у каждого человека была какая-то суперсила. Однако не все использовали ее во имя добра — кое-кто встал на преступную дорожку. Но, к счастью, появились и те, кто готов посвятить себя борьбе со злом! Они будто сошли со страниц комиксов. Со временем эти герои получили официальное одобрение правительства, и с тех пор они стоят на страже порядка! Это история знакомства «беспричудного» мальчика Идзуку Мидории со своим кумиром, легендарным героем Всемогущим, и превращения этого незаметного паренька в самого великого героя в мире. © Азбука-Аттикус",
      "type": "manga",
      "vipPrice": "5",
      "image": "https://staticlib.me/uploads/cover/boku_no_hero_academia/cover/aI6dcRh5Qjah_250x350.jpg",
      "year": "2014",
      "genres": [
        "action"
      ],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0,
          "uids": []
        }
      ],
      "comments": [],
      "id": 7,
      "price": null
    },
    {
      "name": "Jujutsu Kaisen",
      "description": "Талантливого Юдзи школьная жизнь мало привлекает. Но всё изменилось, когда он становится частью клуба оккультных исследований и находит один из пальцев великого Проклятого духа по имени «Сукуна».",
      "type": "manga",
      "vipPrice": "30",
      "image": "https://staticlib.me/uploads/cover/jujutsu-kaisen/cover/T8UWjJX268rT_250x350.jpg",
      "year": "2018",
      "genres": [],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0,
          "uids": []
        }
      ],
      "comments": [],
      "id": 8
    },
    {
      "name": "OnePunchMan",
      "description": "Манга повествует о молодом человеке по имени Сайтама. Он — герой, обычный герой. Основная его проблема в том, что он вышибает дух из злодеев одним ударом. А это очень скучно…",
      "type": "manga",
      "vipPrice": "35",
      "image": "https://staticlib.me/uploads/cover/onepunchman/cover/s73jPvhUoEgm_250x350.jpg",
      "year": "2012",
      "genres": [],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0,
          "uids": []
        }
      ],
      "comments": [],
      "id": 9
    },
    {
      "name": "One Piece",
      "description": "Последние слова, произнесённые Королем Пиратов Гол Д. Роджером перед казнью, вдохновили многих выйти в море: «Мои сокровища? Я завещаю их тому, кто сможет их найти. Ищите! Я все оставил в одном месте!». Лишённые сна и покоя люди ринулись на Гранд Лайн, самое опасное место в мире. Так началась великая эра пиратов... Но с каждым годом романтиков становилось все меньше, их постепенно вытесняли прагматичные пираты-разбойники, которым награбленное добро было куда ближе, чем какие-то «никчёмные мечты». Но вот, одним прекрасным днем, семнадцатилетний Монки Д. Луффи исполнил заветную мечту детства — отправился в море. Его цель — ни много, ни мало стать новым Королём Пиратов. За достаточно короткий срок юному капитану удаётся собрать команду, состоящую из не менее амбициозных искателей приключений. И пусть ими движут совершенно разные устремления, главное, этим ребятам важны не столько деньги и слава, сколько куда более ценное – принципы и верность друзьям. И ещё – служение Мечте. Что же, пока по Гранд Лайн плавают такие люди, Великая Эра Пиратов всегда будет с нами!",
      "type": "manga",
      "vipPrice": "10",
      "image": "https://staticlib.me/uploads/cover/one-piece/cover/mdsP94EVwVlj_250x350.jpg",
      "year": "1997",
      "genres": [],
      "rate": [
        {
          "rateAvg": 0,
          "rateAmount": 0,
          "rateSum": 0,
          "uids": []
        }
      ],
      "comments": [],
      "id": 10
    }
  ]
}